Synwit-Co-Ltd/SWM241_UserBoot/SWM241_APP/CSL/SWM241_StdPeriph_Driver/SWM241_pwm.c
	if((pwmx%2) == 0) PWMx->DZA = deadzone;
	else              PWMx->DZB = deadzone;
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_GetDeadzone()
* 功能说明: 获取死区时长
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: uint16_t					获取到的死区时长
* 注意事项: 无
******************************************************************************************************************************************/
uint16_t  PWM_GetDeadzone(uint32_t pwmx)
{
	PWM_TypeDef * PWMx = PWMX[pwmx];
		
	if((pwmx%2) == 0) return PWMx->DZA;
	else              return PWMx->DZB;
}


/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntNCycleEn()
* 功能说明: 新周期开始中断使能
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntNCycleEn(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->IE |= (0x01 << PWMG_IE_NC0A_Pos);
		else			  PWMG->IE |= (0x01 << PWMG_IE_NC0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->IE |= (0x01 << PWMG_IE_NC1A_Pos);
		else			  PWMG->IE |= (0x01 << PWMG_IE_NC1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->IE |= (0x01 << PWMG_IE_NC2A_Pos);
		else			  PWMG->IE |= (0x01 << PWMG_IE_NC2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->IE |= (0x01 << PWMG_IE_NC3A_Pos);
		else			  PWMG->IE |= (0x01 << PWMG_IE_NC3B_Pos);
		break;
	} 
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntNCycleDis()
* 功能说明: 新周期开始中断禁能
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntNCycleDis(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->IE &= ~(0x01 << PWMG_IE_NC0A_Pos);
		else			  PWMG->IE &= ~(0x01 << PWMG_IE_NC0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->IE &= ~(0x01 << PWMG_IE_NC1A_Pos);
		else			  PWMG->IE &= ~(0x01 << PWMG_IE_NC1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->IE &= ~(0x01 << PWMG_IE_NC2A_Pos);
		else			  PWMG->IE &= ~(0x01 << PWMG_IE_NC2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->IE &= ~(0x01 << PWMG_IE_NC3A_Pos);
		else			  PWMG->IE &= ~(0x01 << PWMG_IE_NC3B_Pos);
		break;
	} 
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntNCycleClr()
* 功能说明: 新周期开始中断标志清除
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntNCycleClr(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->NCIRS = (0x01 << PWMG_NCIRS_PWM0A_Pos);
		else			  PWMG->NCIRS = (0x01 << PWMG_NCIRS_PWM0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->NCIRS = (0x01 << PWMG_NCIRS_PWM1A_Pos);
		else			  PWMG->NCIRS = (0x01 << PWMG_NCIRS_PWM1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->NCIRS = (0x01 << PWMG_NCIRS_PWM2A_Pos);
		else			  PWMG->NCIRS = (0x01 << PWMG_NCIRS_PWM2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->NCIRS = (0x01 << PWMG_NCIRS_PWM3A_Pos);
		else			  PWMG->NCIRS = (0x01 << PWMG_NCIRS_PWM3B_Pos);
		break;
	} 
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntNCycleStat()
* 功能说明: 新周期开始中断是否发生
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: uint32_t				非0 新周期开始中断已发生    0 新周期开始中断未发生
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t PWM_IntNCycleStat(uint32_t pwmx)
{	
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) return (PWMG->NCIF & PWMG_NCIF_PWM0A_Msk);
		else			  return (PWMG->NCIF & PWMG_NCIF_PWM0B_Msk);

	case((uint32_t)PWM1):
		if((pwmx%2) == 0) return (PWMG->NCIF & PWMG_NCIF_PWM1A_Msk);
		else			  return (PWMG->NCIF & PWMG_NCIF_PWM1B_Msk);

	case((uint32_t)PWM2):
		if((pwmx%2) == 0) return (PWMG->NCIF & PWMG_NCIF_PWM2A_Msk);
		else			  return (PWMG->NCIF & PWMG_NCIF_PWM2B_Msk);
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) return (PWMG->NCIF & PWMG_NCIF_PWM3A_Msk);
		else			  return (PWMG->NCIF & PWMG_NCIF_PWM3B_Msk);
	}
	
	return 0;
}


/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntHEndEn()
* 功能说明: 高电平结束中断使能
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntHEndEn(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->IE |= (0x01 << PWMG_IE_HE0A_Pos);
		else			  PWMG->IE |= (0x01 << PWMG_IE_HE0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->IE |= (0x01 << PWMG_IE_HE1A_Pos);
		else			  PWMG->IE |= (0x01 << PWMG_IE_HE1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->IE |= (0x01 << PWMG_IE_HE2A_Pos);
		else			  PWMG->IE |= (0x01 << PWMG_IE_HE2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->IE |= (0x01 << PWMG_IE_HE3A_Pos);
		else			  PWMG->IE |= (0x01 << PWMG_IE_HE3B_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntHEndDis()
* 功能说明: 高电平结束中断禁能
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntHEndDis(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->IE &= ~(0x01 << PWMG_IE_HE0A_Pos);
		else			  PWMG->IE &= ~(0x01 << PWMG_IE_HE0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->IE &= ~(0x01 << PWMG_IE_HE1A_Pos);
		else			  PWMG->IE &= ~(0x01 << PWMG_IE_HE1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->IE &= ~(0x01 << PWMG_IE_HE2A_Pos);
		else			  PWMG->IE &= ~(0x01 << PWMG_IE_HE2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->IE &= ~(0x01 << PWMG_IE_HE3A_Pos);
		else			  PWMG->IE &= ~(0x01 << PWMG_IE_HE3B_Pos);
		break;
	} 
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntHEndClr()
* 功能说明: 高电平结束中断标志清除
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntHEndClr(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->HEIRS = (0x01 << PWMG_HEIRS_PWM0A_Pos);
		else			  PWMG->HEIRS = (0x01 << PWMG_HEIRS_PWM0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->HEIRS = (0x01 << PWMG_HEIRS_PWM1A_Pos);
		else			  PWMG->HEIRS = (0x01 << PWMG_HEIRS_PWM1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->HEIRS = (0x01 << PWMG_HEIRS_PWM2A_Pos);
		else			  PWMG->HEIRS = (0x01 << PWMG_HEIRS_PWM2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->HEIRS = (0x01 << PWMG_HEIRS_PWM3A_Pos);
		else			  PWMG->HEIRS = (0x01 << PWMG_HEIRS_PWM3B_Pos);
		break;
	} 
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntHEndStat()
* 功能说明: 高电平结束中断是否发生
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: uint32_t				非0 高电平结束中断已发生    0 高电平结束中断未发生
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t PWM_IntHEndStat(uint32_t pwmx)
{	
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) return (PWMG->HEIF & PWMG_HEIF_PWM0A_Msk);
		else			  return (PWMG->HEIF & PWMG_HEIF_PWM0B_Msk);

	case((uint32_t)PWM1):
		if((pwmx%2) == 0) return (PWMG->HEIF & PWMG_HEIF_PWM1A_Msk);
		else			  return (PWMG->HEIF & PWMG_HEIF_PWM1B_Msk);

	case((uint32_t)PWM2):
		if((pwmx%2) == 0) return (PWMG->HEIF & PWMG_HEIF_PWM2A_Msk);
		else			  return (PWMG->HEIF & PWMG_HEIF_PWM2B_Msk);
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) return (PWMG->HEIF & PWMG_HEIF_PWM3A_Msk);
		else			  return (PWMG->HEIF & PWMG_HEIF_PWM3B_Msk);
	}
	
