Synwit-Co-Ltd/SWM241_UserBoot/SWM241_APP/CSL/SWM241_StdPeriph_Driver/SWM241_pwm.c
	return 0;
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntHCycleEn()
* 功能说明: 半周期中断使能
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntHCycleEn(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->HCIE |= (0x01 << PWMG_HCIE_PWM0A_Pos);
		else			  PWMG->HCIE |= (0x01 << PWMG_HCIE_PWM0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->HCIE |= (0x01 << PWMG_HCIE_PWM1A_Pos);
		else			  PWMG->HCIE |= (0x01 << PWMG_HCIE_PWM1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->HCIE |= (0x01 << PWMG_HCIE_PWM2A_Pos);
		else			  PWMG->HCIE |= (0x01 << PWMG_HCIE_PWM2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->HCIE |= (0x01 << PWMG_HCIE_PWM3A_Pos);
		else			  PWMG->HCIE |= (0x01 << PWMG_HCIE_PWM3B_Pos);
		break;
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntHCycleDis()
* 功能说明: 半周期中断禁能
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntHCycleDis(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->HCIE &= ~(0x01 << PWMG_HCIE_PWM0A_Pos);
		else			  PWMG->HCIE &= ~(0x01 << PWMG_HCIE_PWM0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->HCIE &= ~(0x01 << PWMG_HCIE_PWM1A_Pos);
		else			  PWMG->HCIE &= ~(0x01 << PWMG_HCIE_PWM1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->HCIE &= ~(0x01 << PWMG_HCIE_PWM2A_Pos);
		else			  PWMG->HCIE &= ~(0x01 << PWMG_HCIE_PWM2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->HCIE &= ~(0x01 << PWMG_HCIE_PWM3A_Pos);
		else			  PWMG->HCIE &= ~(0x01 << PWMG_HCIE_PWM3B_Pos);
		break;
	} 
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntHCycleClr()
* 功能说明: 半周期中断标志清除
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntHCycleClr(uint32_t pwmx)
{
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) PWMG->HCIRS = (0x01 << PWMG_HCIRS_PWM0A_Pos);
		else			  PWMG->HCIRS = (0x01 << PWMG_HCIRS_PWM0B_Pos);
		break;
	
	case((uint32_t)PWM1):
		if((pwmx%2) == 0) PWMG->HCIRS = (0x01 << PWMG_HCIRS_PWM1A_Pos);
		else			  PWMG->HCIRS = (0x01 << PWMG_HCIRS_PWM1B_Pos);
		break;
	
	case((uint32_t)PWM2):
		if((pwmx%2) == 0) PWMG->HCIRS = (0x01 << PWMG_HCIRS_PWM2A_Pos);
		else			  PWMG->HCIRS = (0x01 << PWMG_HCIRS_PWM2B_Pos);
		break;
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) PWMG->HCIRS = (0x01 << PWMG_HCIRS_PWM3A_Pos);
		else			  PWMG->HCIRS = (0x01 << PWMG_HCIRS_PWM3B_Pos);
		break;
	} 
}

/****************************************************************************************************************************************** 
* 函数名称:	PWM_IntHCycleStat()
* 功能说明: 半周期中断是否发生
* 输    入: uint32_t pwmx			指定要被设置的PWM，有效值包括PWM0A、PWM0B、PWM1A、PWM1B、PWM2A、PWM2B、PWM3A、PWM3B
* 输    出: uint32_t				非0 半周期中断已发生    0 半周期中断未发生
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t PWM_IntHCycleStat(uint32_t pwmx)
{	
	switch((uint32_t)PWMX[pwmx])
	{
	case((uint32_t)PWM0):
		if((pwmx%2) == 0) return (PWMG->HCIF & PWMG_HCIF_PWM0A_Msk);
		else			  return (PWMG->HCIF & PWMG_HCIF_PWM0B_Msk);

	case((uint32_t)PWM1):
		if((pwmx%2) == 0) return (PWMG->HCIF & PWMG_HCIF_PWM1A_Msk);
		else			  return (PWMG->HCIF & PWMG_HCIF_PWM1B_Msk);

	case((uint32_t)PWM2):
		if((pwmx%2) == 0) return (PWMG->HCIF & PWMG_HCIF_PWM2A_Msk);
		else			  return (PWMG->HCIF & PWMG_HCIF_PWM2B_Msk);
	
	case((uint32_t)PWM3):
		if((pwmx%2) == 0) return (PWMG->HCIF & PWMG_HCIF_PWM3A_Msk);
		else			  return (PWMG->HCIF & PWMG_HCIF_PWM3B_Msk);
	}
	
	return 0;
}
